import Markdown from "react-markdown";
import "./doc.css"

const markdown = `
# **ХАРТІЯ ПРАВ ТА ЗОБОВ'ЯЗАНЬ** 


**Стаття 1.** Парламент є органом самоуправління учнів школи "Basis", їх голосом та  найвірнішим захисником їх інтересів.  


Депутати парламенту працюють на інтереси школи та її учнів. 


Парламент є відкритим до відвідування не-членами парламенту. 


**Стаття 2.** Депутати парламенту обираються членами класу на один календарний рік у  другу середу вересня на загальних виборах. За вимогою хоча б одного виборця, вибори  проводяться таємно.  


Якщо у паралелі є лише один клас, то від нього обираються 2 депутати — той, хто набрав  більше всього голосів, та той, хто на другому місці. У іншому випадку, від кожного класу на  паралелі обирається по одному депутату. 


**Стаття 3.** Депутати беруть на себе зобов'язання регулярно відвідувати засідання  парламенту. 


Пропустити засідання парламенту можна лише у випадку наявності поважної причини,  поважність якої визначає спікер або заступники спікера в окремому порядку.  


За 3 пропущених засідання підряд без поважної причини, депутат виключається з  парламенту. В класі, який він представляв, протягом одного тижня після виключення  відбуваються дострокові вибори, або відбувається його заміна. 

Депутат, що був обраний на дострокових виборах, обирається лише до загальних виборів  у вересні. 


Заміна відбувається на учня того самого класу, який був присутнім на трьох будь-яких  засіданнях парламенту (себто, розуміє як працює парламент) та згоден стати депутатом.  


Депутат може піти у відставку. Заради цього, депутат передає спікеру або заступнику  спікера письмову заяву у вільній формі про своє бажання звільнити посаду. Процес  обрання депутата після відставки попереднього такий самий, як у випадку з виключенням  парламентом попереднього депутату. 


Депутат може бути відправлений у відставку учнями свого класу. Порядок відправлення  депутату у відставку таким чином вказаний Хартією про Вотум Недовіри. 


**Стаття 4.** Спікер парламенту оголошує порядок денний засідань, підтримує порядок на  засіданнях та створює умови для ефективної роботи парламенту.  


Спікер парламенту має право виключити депутату з засідання на період до 30 хвилин або  до його кінця, якщо буде вважати це потрібним.  


Заступники спікеру (двоє) роблять щотижневі звіти щодо роботи парламенту та засідань,  допомагають спікеру в його зусиллях щодо підтримання працюючого парламенту, та  замінюють його за відсутності.


І спікер і його заступники обираються депутатами на другому засіданні парламенту після  загальних виборів. Під час першого засідання відбувається знайомство депутатів та  оголошення тими, у кого є бажання, балотуватись у спікери та заступники спікерів. 


Спікер та заступники спікерів можуть подати у відставку. Обрання спікера та заступників  спікерів після відставки попередніх відбувається таким самим чином, як відбувається  обрання депутату після виключення парламентом попереднього, за винятком того що  обирають нового спікера та заступників депутати. 


Спікер може бути відправлений у відставку. Порядок відправлення спікера у відставку  вказаний Хартією про Вотум Недовіри. 


**Стаття 5.** Рішення депутатами приймаються під час засідань більшістю голосів у >50%, за  винятком випадків, вказаних у статті 7.  


Кворум — необхідна кількість депутатів присутніх на засіданні для того, щоб на засіданні  можна було приймати рішення — 5 представників.  


**Стаття 6.** В парламенті існують комітети, які є об'єднанням депутатів та інших учнів школи  що не належать парламенту, та які займаються специфічними питаннями, які їм цікаві  та/або на яких вони знаються найкраще. Приклад: комітет клубів піклується зверненнями  клубів, їх роботи і так далі.  


Максимальна кількість депутатів в комітеті — 6 (шість). Мінімальна — 2 (два).  


Комітети збираються в будь-який зручний для його членів час, місці та форматі (кафе,  домівка одного з членів, школа, онлайн конференція тощо). 


**Стаття 7.** Парламентом не може бути прийняте рішення про ліквідацію парламенту,  школи, класів чи Хартії Прав та Зобов'язань.  


Зміни в Хартію Прав та Зобов'язань приймаються більшістю у >66%.

**ХАРТІЯ ПРО ВОТУМ НЕДОВІРИ** 

**Стаття 1.** Згідно з Хартією Прав та Зобов'язань, депутат може бути відправлений у  відставку своїм класом. Спікер може бути відправлений у відставку парламентом. Задля  цього, депутатові або спікеру має бути висунений Вотум Недовіри від як мінімум трьох  учнів або трьох депутатів. 


**Стаття 2.** Вотум Недовіри має мати поважну причину, та аргументацію, чому ця причина  дійсна. До поважних причин належать: 


- ігнорування бажань класу (причина тільки для відставки депутата); - невиконання своїх обов'язків; 


- зловживання повноваженнями; 


- цілеспрямовані дії з метою порушити роботу школи чи парламенту; - порушення правил школи; 


- порушення закону України. 


**Стаття 3.** Вотум Недовіри до депутата приймається керівником класу та виноситься на  класній годині на розгляд. Вотум Недовіри до спікера приймається заступником спікера  та виноситься їм на наступному засіданні парламенту на розгляд. Після розгляду,  відбувається голосування щодо реалізації Вотума Недовіри та відсторонення депутата  або спікера.  


Задля його прийняття, потрібна більшість голосів у >50% для відставки депутата та для  відставки спікера, за винятком, якщо причиною до Вотуму Недовіри є невиконання своїх  обов'язків. 


**Стаття 4.** Після відсторонення депутата, проводиться його заміна згідно з таким самим  принципом, як і у випадку з виключенням попереднього депутату парламентом. Заміна  спікера після його відсторонення відбувається за таким самим чином, як і у випадку з  відставкою спікера. Ці принципи вказані в Хартії Прав та Зобов'язань.

`

function Home() {
    return  <div className=" grid w-screen h-screen place-items-center p-20 max-md:pt-10 max-md:p-0">
                <div className=" w-[80ch] max-md:w-full h-full m-10 dark:bg-black bg-white rounded-t-3xl p-10 max-md:p-5 ring-4 ring-black/50 dark:ring-white/50">
                        <Markdown>{markdown}</Markdown>
                </div>
            </div>
}
export default Home